[
    {
        "id": "10301111",
        "name": "การเขียนโปรแกรมเบื้องต้น",
        "gpa": "3 (2-3-5)",
        "yearterm": "1-1",
        "about": "หลักการเขียนโปรแกรมเบื้องต้น อัลกอริทึม โครงสร้างของโปรแกรม การเขียนผังงาน มาตรฐานตัวแปร ชนิดข้อมูลการคำนวณทางคณิตศาสตร์และลอจิก การเขียนโปรแกรมรับข้อมูลและแสดงผล การเขียนโปรแกรมแบบเงื่อนไข การเขียนโปรแกรมแบบวนซ้ำการประมวลผลข้อมูล(ข้อความ/ไฟล์) การสร้างฟังก์ชัน โครงสร้างข้อมูล การใช้งานไลบราลี่ต่าง ๆ"
    },
    {
        "id": "10301112",
        "name": "เทคโนโลยีสารสนเทศและการสื่อสาร",
        "gpa": "3 (2-3-5)",
        "yearterm": "1-1",
        "about": "ระบบสารสนเทศ โปรแกรมสำนักงานพื้นฐาน การทำงานด้านเอกสาร งานด้าน การคำนวณและวิเคราะห์ข้อมูล หลักการสืบค้นรวบรวมและอ้างอิงข้อมูล การป้องกันข้อมูล ในระบบคอมพิวเตอร์ บทบาทสื่อสังคมออนไลน์ทฤษฎีและองค์ประกอบการออกแบบมัลติมีเดีย การนำเสนอข้อมูล การสร้างสรรค์ผลงานด้านดิจิทัลเพื่อสื่อสารกับกลุ่มเป้าหมายในรูปแบบต่าง ๆ ทั้งข้อความ รูปภาพ วิดีโอ และข้อมูลเชิงภาพ",
        "class": "",
        "Teacher": ""
    },
    {
        "id": "10100214",
        "name": "เกษตรเพื่อชีวิต",
        "gpa": "3 (3-0-6)",
        "yearterm": "1-1",
        "about": "วิวัฒนาการ และความสำคัญของการเกษตร ความหลากหลายทางชีวภาพในระบบนิเวศวิทยา ปัจจัยด้านสิ่งแวดล้อมที่มีผลต่อปัจจัยการผลิตทางการเกษตร ระบบการเกษตร ทรัพยากรการผลิตด้านจุลินทรีย์ พืช สัตว์ ประมง: ความหลากหลายของทรัพยากร การนำมาใช้ประโยชน์ การจัดการและการอนุรักษ์ เพื่อการเกษตรที่ยั่งยืน และเป็นมิตรต่อสิ่งแวดล้อม การสื่อสารองค์ความรู้ทางการเกษตร การพัฒนาตามแนวพระราชดำริกับการเกษตร",
        "class": "",
        "Teacher": ""
    },
    {
        "id": "10700301",
        "name": "ภาษาไทยเพื่อการนำเสนอ",
        "gpa": "3 (2-2-5)",
        "yearterm": "1-1",
        "about": "ฝึกทักษะการใช้ภาษาไทยเพื่อการนำเสนอในรูปแบบต่างๆ ได้อย่างมีประสิทธิภาพเหมาะสมกับสถานการณ์และสื่อต่างๆ อย่างสร้างสรรค์",
        "class": "",
        "Teacher": ""
    },
    {
        "id": "10700308",
        "name": "ภาษาอังกฤษในชีวิตประจำวัน",
        "gpa": "3 (2-2-5)",
        "yearterm": "1-1",
        "about": "ภาษาอังกฤษเพื่อการสื่อสารในชีวิตประจำวัน เน้นคำศัพท์ ไวยากรณ์ ทักษะการฟัง การพูด การอ่านและการเขียน",
        "class": "",
        "Teacher": ""
    },
    {
        "id": "10305108",
        "name": "แคลคูลัสสำหรับวิทยาศาสตร์และเทคโนโลยี",
        "gpa": "3 (2-3-5)",
        "yearterm": "1-1",
        "about": "ลิมิตและความต่อเนื่องของฟังก์ชัน อนุพันธ์ของฟังก์ชันและการประยุกต์ อินทิกรัลไม่จำกัดเขตและอินทิกรัลจำกัดเขต สมการเชิงอนุพันธ์สามัญอันดับหนึ่งและการประยุกต์ เมทริกซ์และการหาผลเฉลยของระบบสมการเชิงเส้น",
        "class": "",
        "Teacher": ""
    },
    {
        "id": "10301114",
        "name": "องค์ประกอบและสถาปัตยกรรมคอมพิวเตอร์",
        "gpa": "3 (2-3-5)",
        "yearterm": "1-2",
        "about": "แนวคิดพื้นฐานของการจัดองค์ประกอบและสถาปัตยกรรมคอมพิวเตอร์ โครงสร้างและการทำงานของระบบคอมพิวเตอร์ หน่วยประมวลผลกลาง หน่วยความจำ ระบบของ การนําเข้าและการแสดงผล ระบบตัวเลขฐาน การออกแบบหน่วยตรรกะและหน่วยควบคุม หลักการทำงานและออกแบบด้านวงจรดิจิทัลและวงจรอิเล็กทรอนิกส์ การทำงานไมโครโพรเซสเซอร์เบื้องต้น สำหรับไอโอที วงจรรวม ชุดของคำสั่งเครื่อง การวัดสมรรถนะ ของคอมพิวเตอร์ ระบบปฏิบัติการ เชลล์ สคริปต์ ผู้ใช้ขั้นสูง ไอทีซัพพอร์ท",
        "class": "",
        "Teacher": ""
    },
    {
        "id": "10301141",
        "name": "เครือข่ายคอมพิวเตอร์เบื้องต้น",
        "gpa": "3 (2-3-5)",
        "yearterm": "1-2",
        "about": "แนวคิดและทฤษฎีการสื่อสารข้อมูล แบบจำลองโอเอสไอ ทีซีพี/ไอพี ระบบเครือข่ายคอมพิวเตอร์ รูปร่างเครือข่าย อินเทอร์เน็ตโพรโทคอล อุปกรณ์เครือข่าย สื่อนำสัญญาณ หมายเลขแมค หมายเลขไอพี การออกแบบและการประยุกต์ใช้งานเครือข่าย ความปลอดภัย ในเครือข่าย อุปกรณ์เครือข่าย สื่อนำสัญญาณไร้สาย",
        "class": "",
        "Teacher": ""
    },
    {
        "id": "10301212",
        "name": "การเขียนโปรแกรมและทักษะการแก้ปัญหา",
        "gpa": "3 (3-0-6)",
        "yearterm": "1-2",
        "about": "การพัฒนาทักษะในการโปรแกรม การแก้ปัญหาด้วยการโปรแกรมคอมพิวเตอร์ การใช้โครงสร้างข้อมูลและขั้นตอนวิธีเพื่อแก้ปัญหาให้เหมาะสม การใช้งานเครื่องมือสำหรับพัฒนาโปรแกรมภาษาต่าง ๆ ที่เหมาะสม",
        "class": "",
        "Teacher": ""
    },
    {
        "id": "10301113",
        "name": "คณิตศาสตร์ดีสครีต",
        "gpa": "3 (2-2-5)",
        "yearterm": "1-2",
        "about": "ทฤษฎีเซต ตรรกศาสตร์ ความสัมพันธ์และฟังก์ชัน การนับ การเรียงสับเปลี่ยนและการจัดกลุ่ม ความสัมพันธ์เวียนเกิด ต้นไม้และการเรียงลำดับ กราฟและการประยุกต์ใช้ อัลกอริทึมข่ายงาน พีชคณิตบูลีน ออโตเมตา",
        "class": "",
        "Teacher": ""
    },
    {
        "id": "10800113",
        "name": "พลเมืองดิจิทัล",
        "gpa": "3 (2-2-5)",
        "yearterm": "1-2",
        "about": "ความสําคัญ แนวคิดและแนวปฏิบัติเกี่ยวกับการเป็นพลเมืองดิจิทัล ได้แก่ การสื่อสารดิจิทัล (Digital Communication) การรู้เท่าทันดิจิทัล (Digital Literacy) การซื้อขายธุรกิจผ่าน / สื่อดิจิทัล (Digital Commerce) การเข้าถึงสื่อดิจิทัล (Digital Access) การใช?สื่ออย?างมีมารยาท (Digital Etiquette) กฎหมายดิจิทัล (Digital Law) สิทธิทางดิจิทัลและความรับผิดชอบ (Digital Right & Responsibilities) ความปลอดภัยทางดิจิทัล (Digital Security) และการใช้สื่อดิจิทัลอย่างมีสุขภาวะทางกายทางใจ (Digital Health) ไปจนถึงเข้าใจผลกระทบของเทคโนโลยีดิจิทัลที่มีต่อสังคม และใช่เพื่อสร้างการเปลี่ยนแปลงทางสังคมในเชิงบวก",
        "class": "",
        "Teacher": ""
    },
    {
        "id": "10700309",
        "name": "สนทนาภาษาอังกฤษ",
        "gpa": "3 (2-3-5)",
        "yearterm": "1-2",
        "about": "พัฒนาความสามารถในการพูดภาษาอังกฤษและสื่อสารในชีวิตประจำวัน โดยครอบคลุมถึงภาษาอังกฤษในการทำงาน และฝึกการออกเสียงที่ถูกต้อง",
        "class": "",
        "Teacher": ""
    }
]